[
 {
   "id": 1,
   "title": "The Prophet of Allah, sallallahu alayhee wa alehee wasalam said: “Religion is sincerity.” We said: “To whom, O the Prophet of Allah?” He said: “To Allah, His Book, His Messenger, to the leaders of the Muslims and their common folk.”",
   "subTitle": "Muslim, Iman (Faith), 95"
 },
 {
   "id": 2,
   "title": "“Islam necessitates having good moral qualities.”",
   "subTitle": "Qanz Al-Ummal, 3/17, Hadith No: 5225"
 },
 {
   "id": 3,
   "title": "“Whoever is not merciful (to the creation) will not be shown mercy by Allah.”",
   "subTitle": "Muslim, Fada’il (Virtues), 66; Tirmidhi, Birr (Piety), 16"
 },
 {
   "id": 4,
   "title": "“Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).”",
   "subTitle": "Bukhari, Ilm (Knowledge), 12; Muslim, Jihad (Holy Struggle), 6"
 },
 {
   "id": 5,
   "title": "Another admonition man has learned from the prophets is the following maxim: “If you have no modesty, then do whatever you wish.”",
   "subTitle": "Bukhari, anbiya’ (Prophets), 54; Aboo Dawood, adab (Good Manners), 6"
 },
 {
   "id": 6,
   "title": "“Whoever opens a way to a charitable deed is like the one that has done this good deed (himself).”",
   "subTitle": "Tirmidhi, ilm (Knowledge), 14"
 },
 {
   "id": 7,
   "title": "“A believer is not bitten twice from the same hole.” (A believer is not mistaken twice with the same fault).",
   "subTitle": "Bukhari, adab (Manners), 83; Muslim, Dhuhd (Adherence to Devotions), 63"
 },
 {
   "id": 8,
   "title": "“Fear Allah wherever you are. Do good immediately after a sinful act to erase it, and always be well-mannered in your relationship with people.”",
   "subTitle": "Tirmidhi, Birr (Piety), 55"
 },
 {
   "id": 9,
   "title": "“Allah is pleased with your doing your jobs, deeds and tasks well and soundly.”",
   "subTitle": "Tabarani, Al-Mujamu Al-Awsah, 1/275; Bayhaqi, Shu’ab Al-Iman (Branches of Faith) 4/334"
 },
 {
   "id": 10,
   "title": "“Faith is composed of 70 odd branches; of which the highest is belief in ‘La Ilaha Illallah’ There is no God but Allah and the lowest is the removal of a hindrance from the road, and the sense of modesty is an important branch of Faith.”",
   "subTitle": "Bukhari, Iman (Faith), 3; Muslim, Iman (Faith), 57-58]"
 },
 {
   "id": 11,
   "title": "“Whoever sees something evil should change it with his hands (unless by doing this it creates a bigger evil). If he cannot, then with his tongue; and if he cannot do even that, then in his heart, which is the weakest degree of faith.”",
   "subTitle": "Muslim, Iman (Faith), 78; Aboo Dawood, Salah (Prayers), 248"
 },
 {
   "id": 12,
   "title": "“The eyes of 2 people that will never witness the fire of Hell: the eyes of a soldier who keeps guard at frontiers and on battlefields, and of those whose awe of Allah causes them to cry.”",
   "subTitle": "Tirmidhi, Fadha’il Al-Jihad (Virtues of War), 12"
 },
 {
   "id": 13,
   "title": "“There is no giving of harm to others nor retaliating harm with harm.”",
   "subTitle": "Ibn Ma’jah, Ahqam (Decrees), 17; Muwattah, Aqdiyyah, 31"
 },
 {
   "id": 14,
   "title": "“None of you will have true faith till he wishes for his (Muslim) brother what he likes for himself.”",
   "subTitle": "Bukhari, Iman (Faith), 7; Muslim, Iman (Faith), 71"
 },
 {
   "id": 15,
   "title": "“A Muslim is a brother of another Muslim, so he should not oppress him, nor should he hand him over to an oppressor. Whoever has fulfilled the needs of his brother, Allah will fulfil his needs; whoever has brought his (Muslim) brother out of a discomfort, Allah will bring him out of the discomforts of the Day of Resurrection, and whoever has screened a Muslim, Allah will screen him (of his faults) on the Day of Resurrection.”",
   "subTitle": "Bukhari, Mazalim (Injustices), 3; Muslim, Birr (Piety), 58"
 },
 {
   "id": 16,
   "title": "“None of you will enter Paradise unless you have faith, and none of you truly have faith unless you love each other.”",
   "subTitle": "Muslim, Iman (Faith), 93; Tirmidhi, Sifat Al-Qiyamah (Attributes of Doomsday) 56"
 },
 {
   "id": 17,
   "title": "“A Muslim is one from whose tongue and hands the Muslims are safe and a believer is one in whom people place their trust in regard to their life and wealth.”",
   "subTitle": "Tirmidhi, Iman (Faith), 12; Nasa’ee, Iman (Faith), 8"
 },
 {
   "id": 18,
   "title": "“Do not shun each other; do not ignore one another; do not hate one another; and do not envy one another; and be brothers with one another, O slaves of Allah. No Muslim is allowed to shun his (Muslim) brother for more than 3 days.”",
   "subTitle": "Bukhari, Adab (Manners), 57-58"
 },
 {
   "id": 19,
   "title": "“It is incumbent upon you to be always truthful, for truthfulness guides to absolute piety and piety leads to Paradise. A man who always tells the truth and pursues the truth is written with Allah as a truthful one. Refrain from lying, for lying guides to sinfulness and sinfulness leads to Hellfire. A man continues to tell lies and pursues lies until he is written with Allah as a liar.”",
   "subTitle": "Bukhari, Adab (Manners), 69; Muslim, Birr (Piety), 103, 104"
 },
 {
   "id": 20,
   "title": "“Do not quarrel with your (Muslim) brothers. Do not make them such jokes as they will not like. Do not make promises to them that you will not keep.”",
   "subTitle": "Tirmidhi, Birr (Piety), 58"
 },
 {
   "id": 21,
   "title": "“Your smiling in the face of your (Muslim) brother is charity; enjoining the good and forbidding the evil is charity; your guiding a man that has lost his way is charity; and your removing of stones, thorns, and bones from people’s paths is charity for you.”",
   "subTitle": "Tirmidhi, Birr (Piety), 36"
 },
 {
   "id": 22,
   "title": "“Allah does not look at your appearance or your possessions; but He looks at your heart and your deeds.”",
   "subTitle": "Muslim, Birr (Piety), 33; Ibn Majah, Dhuhd (Observance of Devotions) 9; Ahmad bin Hanbal, 2/285, 539"
 },
 {
   "id": 23,
   "title": "“Allah’s Pleasure lies in the pleasure of one’s parents; while His Wrath too lies in the wrath of theirs.”",
   "subTitle": "Tirmidhi, Birr (Piety), 3"
 },
 {
   "id": 24,
   "title": "“Three prayers are answered without doubt: A prayer by a person suffering injustice, and a prayer by a traveller, and a prayer by a father for his children.”",
   "subTitle": "Ibn Majah, Dua (Prayer), 11"
 },
 {
   "id": 25,
   "title": "“No father can give his children a better gift than good manners.”",
   "subTitle": "Tirmidhi, Birr (Piety), 33"
 },
 {
   "id": 26,
   "title": "“The best among you are those who give the best treatment to their wives.”",
   "subTitle": "Tirmidhi, Radah, 11; Ibn Majah, Niqah (Wedding), 50"
 },
 {
   "id": 27,
   "title": "“Whoever does not show affection to the young and respect to the old is not one of us.”",
   "subTitle": "Tirmidhi, Birr (Piety), 15; Aboo Dawood, Adab (Manners) 66"
 },
 {
   "id": 28,
   "title": "“Making a motion of his index and middle fingers our Prophet said, ‘Whoever supports an orphan from among his own or any other family will be as close to me in Heaven as these fingers are close to each other.”",
   "subTitle": "Bukhari, Talaq (Divorce), 25; Adab (Good Manners), 24; Muslim, Dhuhd (Observance of Devotions), 42"
 },
 {
   "id": 29,
   "title": "“Avoid the 7 great destructive sins.” The Muslims enquired, “O Messenger of Allah! What are they? “He said, “To join others in worship along with Allah (shirk), to practice sorcery (magic), to kill the life which Allah has forbidden except for a just cause(according to Islamic law) (murder), to eat up Ribah (usury) (interest), to eat up an orphan’s wealth (usurp), to give back to the enemy and fleeing from the battlefield at the time of fighting (cowardice), and to accuse chaste women, who has never thought of anything touching her chastity and are good believers (false accusation).”",
   "subTitle": "Bukhari, Wasayah, 23; Tıbb (Medicine), 48; Muslim, Iman (Faith), 144"
 },
 {
   "id": 30,
   "title": "“Anybody who believes in Allah and the Last Day should not harm his neighbour, and anybody who believes in Allah and the Last Day should entertain his guest generously and anybody who believes in Allah and the Last Day should talk what is good or keep quiet.”",
   "subTitle": "Bukhari, Adab (Manners), 31, 85; Muslim, Iman (Faith), 74, 75"
 },
 {
   "id": 31,
   "title": "“Jibra’il kept on recommending me about treating the neighbours in a kind and polite manner, so much so that I thought that he would order (me) to make them (my) heirs.”",
   "subTitle": "Bukhari, Adab (Manners), 28; Muslim, Birr (Piety), 140, 141"
 },
 {
   "id": 32,
   "title": "“The one who helps widows and poor people is like a warrior fighting for Allah’s Cause or like a person who fasts during the day and prays all the night.”",
   "subTitle": "Bukhari, Nafaqah (Alimony), 1; Muslim, Dhuhd (Observance of Devotions), 41; Tirmidhi, Birr (Piety), 4; Nasa’ee, Zaqah (Poor-due), 78"
 },
 {
   "id": 33,
   "title": "“Everybody errs. The best of those who have erred are those that repent.”",
   "subTitle": "Tirmidhi, Qiyamah (Doomsday), 49; Ibn Al-Majah, Dhuhd (Observance of Devotions), 30"
 },
 {
   "id": 34,
   "title": "“The condition of the believer is worthy of envy and admiration, because every state they are in is a cause of benefit. Such a quality is unique to the believer: When they are delighted, they praise (Allah) and this is a benefit; when they suffer harm, they show patience and this is also a benefit.”",
   "subTitle": "Muslim, Dhuhd (Observance of Devotions), 64; Darim, Riqaq, 61"
 },
 {
   "id": 35,
   "title": "“Those who cheat are not of us.”",
   "subTitle": "Muslim, Iman (Faith), 164"
 },
 {
   "id": 36,
   "title": "“Talebearers shall not be admitted to the Paradise (unless they have suffered their due penalty or are forgiven).”",
   "subTitle": "Muslim, Iman (Faith), 168; Tirmidhi, Birr (Piety), 79"
 },
 {
   "id": 37,
   "title": "“Give workers their wages before their tears (on their foreheads) have dried.”",
   "subTitle": "Ibn Majah, Ruhun, 4"
 },
 {
   "id": 38,
   "title": "“What people, animals or birds eat of the fruit of those trees or crops planted or raised by a Muslim is a charity for him.”",
   "subTitle": "Bukhari, Adab (Manners), 27; Muslim, Musaqah, 7, 10"
 },
 {
   "id": 39,
   "title": "“In everybody there is a piece of flesh, if it is healthy, the whole body is healthy, and if it is sick, the whole body is sick. Beware! It is the heart!”",
   "subTitle": "Bukhari, Iman (Faith), 39; Muslim, Musaqah, 107"
 },
 {
   "id": 40,
   "title": "“Do not rebel against your Lord; establish 5 daily prayers; fast in the Month of Ramadhan, give the alms of your property; obey your superiors. (Thus) you will be admitted to the Paradise of your Lord.”",
   "subTitle": "Tirmidhi, Jumiah, 80"
 }
]